export const CITY_LIST = [{"name": "北京市", "simple": "北京"}, {"name": "上海市", "simple": "上海"}, {
    "name": "天津市",
    "simple": "天津"
}, {
    "name": "重庆市",
    "simple": "重庆"
}, {
    "name": "广东省",
    "simple": "广东",
    "cities": [{"name": "广州市", "simple": "广州"}, {"name": "韶关市", "simple": "韶关"}, {
        "name": "深圳市",
        "simple": "深圳"
    }, {"name": "珠海市", "simple": "珠海"}, {"name": "汕头市", "simple": "汕头"}, {
        "name": "佛山市",
        "simple": "佛山"
    }, {"name": "江门市", "simple": "江门"}, {"name": "湛江市", "simple": "湛江"}, {
        "name": "茂名市",
        "simple": "茂名"
    }, {"name": "肇庆市", "simple": "肇庆"}, {"name": "惠州市", "simple": "惠州"}, {
        "name": "梅州市",
        "simple": "梅州"
    }, {"name": "汕尾市", "simple": "汕尾"}, {"name": "河源市", "simple": "河源"}, {
        "name": "阳江市",
        "simple": "阳江"
    }, {"name": "清远市", "simple": "清远"}, {"name": "东莞市", "simple": "东莞"}, {
        "name": "中山市",
        "simple": "中山"
    }, {"name": "潮州市", "simple": "潮州"}, {"name": "揭阳市", "simple": "揭阳"}, {"name": "云浮市", "simple": "云浮"}]
}, {
    "name": "江苏省",
    "simple": "江苏",
    "cities": [{"name": "南京市", "simple": "南京"}, {"name": "无锡市", "simple": "无锡"}, {
        "name": "徐州市",
        "simple": "徐州"
    }, {"name": "常州市", "simple": "常州"}, {"name": "苏州市", "simple": "苏州"}, {
        "name": "南通市",
        "simple": "南通"
    }, {"name": "连云港市", "simple": "连云港"}, {"name": "淮安市", "simple": "淮安"}, {
        "name": "盐城市",
        "simple": "盐城"
    }, {"name": "扬州市", "simple": "扬州"}, {"name": "镇江市", "simple": "镇江"}, {
        "name": "泰州市",
        "simple": "泰州"
    }, {"name": "宿迁市", "simple": "宿迁"}]
}, {
    "name": "山东省",
    "simple": "山东",
    "cities": [{"name": "济南市", "simple": "济南"}, {"name": "青岛市", "simple": "青岛"}, {
        "name": "淄博市",
        "simple": "淄博"
    }, {"name": "枣庄市", "simple": "枣庄"}, {"name": "东营市", "simple": "东营"}, {
        "name": "烟台市",
        "simple": "烟台"
    }, {"name": "潍坊市", "simple": "潍坊"}, {"name": "济宁市", "simple": "济宁"}, {
        "name": "泰安市",
        "simple": "泰安"
    }, {"name": "威海市", "simple": "威海"}, {"name": "日照市", "simple": "日照"}, {
        "name": "莱芜市",
        "simple": "莱芜"
    }, {"name": "临沂市", "simple": "临沂"}, {"name": "德州市", "simple": "德州"}, {
        "name": "聊城市",
        "simple": "聊城"
    }, {"name": "滨州市", "simple": "滨州"}, {"name": "菏泽市", "simple": "菏泽"}]
}, {
    "name": "浙江省",
    "simple": "浙江",
    "cities": [{"name": "杭州市", "simple": "杭州"}, {"name": "宁波市", "simple": "宁波"}, {
        "name": "温州市",
        "simple": "温州"
    }, {"name": "嘉兴市", "simple": "嘉兴"}, {"name": "湖州市", "simple": "湖州"}, {
        "name": "绍兴市",
        "simple": "绍兴"
    }, {"name": "金华市", "simple": "金华"}, {"name": "衢州市", "simple": "衢州"}, {
        "name": "舟山市",
        "simple": "舟山"
    }, {"name": "台州市", "simple": "台州"}, {"name": "丽水市", "simple": "丽水"}]
}, {
    "name": "河南省",
    "simple": "河南",
    "cities": [{"name": "郑州市", "simple": "郑州"}, {"name": "开封市", "simple": "开封"}, {
        "name": "洛阳市",
        "simple": "洛阳"
    }, {"name": "平顶山市", "simple": "平顶山"}, {"name": "安阳市", "simple": "安阳"}, {
        "name": "鹤壁市",
        "simple": "鹤壁"
    }, {"name": "新乡市", "simple": "新乡"}, {"name": "焦作市", "simple": "焦作"}, {
        "name": "濮阳市",
        "simple": "濮阳"
    }, {"name": "许昌市", "simple": "许昌"}, {"name": "漯河市", "simple": "漯河"}, {
        "name": "三门峡市",
        "simple": "三门峡"
    }, {"name": "南阳市", "simple": "南阳"}, {"name": "商丘市", "simple": "商丘"}, {
        "name": "信阳市",
        "simple": "信阳"
    }, {"name": "周口市", "simple": "周口"}, {"name": "驻马店市", "simple": "驻马店"}]
}, {
    "name": "四川省",
    "simple": "四川",
    "cities": [{"name": "成都市", "simple": "成都"}, {"name": "自贡市", "simple": "自贡"}, {
        "name": "攀枝花市",
        "simple": "攀枝花"
    }, {"name": "泸州市", "simple": "泸州"}, {"name": "德阳市", "simple": "德阳"}, {
        "name": "绵阳市",
        "simple": "绵阳"
    }, {"name": "广元市", "simple": "广元"}, {"name": "遂宁市", "simple": "遂宁"}, {
        "name": "内江市",
        "simple": "内江"
    }, {"name": "乐山市", "simple": "乐山"}, {"name": "南充市", "simple": "南充"}, {
        "name": "眉山市",
        "simple": "眉山"
    }, {"name": "宜宾市", "simple": "宜宾"}, {"name": "广安市", "simple": "广安"}, {
        "name": "达州市",
        "simple": "达州"
    }, {"name": "雅安市", "simple": "雅安"}, {"name": "巴中市", "simple": "巴中"}, {
        "name": "资阳市",
        "simple": "资阳"
    }, {"name": "阿坝藏族羌族自治州", "simple": "阿坝"}, {"name": "甘孜藏族自治州", "simple": "甘孜"}, {"name": "凉山彝族自治州", "simple": "凉山"}]
}, {
    "name": "湖北省",
    "simple": "湖北",
    "cities": [{"name": "武汉市", "simple": "武汉"}, {"name": "黄石市", "simple": "黄石"}, {
        "name": "十堰市",
        "simple": "十堰"
    }, {"name": "宜昌市", "simple": "宜昌"}, {"name": "襄阳市", "simple": "襄阳"}, {
        "name": "鄂州市",
        "simple": "鄂州"
    }, {"name": "荆门市", "simple": "荆门"}, {"name": "孝感市", "simple": "孝感"}, {
        "name": "荆州市",
        "simple": "荆州"
    }, {"name": "黄冈市", "simple": "黄冈"}, {"name": "咸宁市", "simple": "咸宁"}, {
        "name": "随州市",
        "simple": "随州"
    }, {"name": "恩施土家族苗族自治州", "simple": "恩施"}]
}, {
    "name": "湖南省",
    "simple": "湖南",
    "cities": [{"name": "长沙市", "simple": "长沙"}, {"name": "株洲市", "simple": "株洲"}, {
        "name": "湘潭市",
        "simple": "湘潭"
    }, {"name": "衡阳市", "simple": "衡阳"}, {"name": "邵阳市", "simple": "邵阳"}, {
        "name": "岳阳市",
        "simple": "岳阳"
    }, {"name": "常德市", "simple": "常德"}, {"name": "张家界市", "simple": "张家界"}, {
        "name": "益阳市",
        "simple": "益阳"
    }, {"name": "郴州市", "simple": "郴州"}, {"name": "永州市", "simple": "永州"}, {
        "name": "怀化市",
        "simple": "怀化"
    }, {"name": "娄底市", "simple": "娄底"}, {"name": "湘西土家族苗族自治州", "simple": "湘西"}]
}, {
    "name": "河北省",
    "simple": "河北",
    "cities": [{"name": "石家庄市", "simple": "石家庄"}, {"name": "唐山市", "simple": "唐山"}, {
        "name": "秦皇岛市",
        "simple": "秦皇岛"
    }, {"name": "邯郸市", "simple": "邯郸"}, {"name": "邢台市", "simple": "邢台"}, {
        "name": "保定市",
        "simple": "保定"
    }, {"name": "张家口市", "simple": "张家口"}, {"name": "承德市", "simple": "承德"}, {
        "name": "沧州市",
        "simple": "沧州"
    }, {"name": "廊坊市", "simple": "廊坊"}, {"name": "衡水市", "simple": "衡水"}]
}, {
    "name": "福建省",
    "simple": "福建",
    "cities": [{"name": "福州市", "simple": "福州"}, {"name": "厦门市", "simple": "厦门"}, {
        "name": "莆田市",
        "simple": "莆田"
    }, {"name": "三明市", "simple": "三明"}, {"name": "泉州市", "simple": "泉州"}, {
        "name": "漳州市",
        "simple": "漳州"
    }, {"name": "南平市", "simple": "南平"}, {"name": "龙岩市", "simple": "龙岩"}, {"name": "宁德市", "simple": "宁德"}]
}, {
    "name": "安徽省",
    "simple": "安徽",
    "cities": [{"name": "合肥市", "simple": "合肥"}, {"name": "芜湖市", "simple": "芜湖"}, {
        "name": "蚌埠市",
        "simple": "蚌埠"
    }, {"name": "淮南市", "simple": "淮南"}, {"name": "马鞍山市", "simple": "马鞍山"}, {
        "name": "淮北市",
        "simple": "淮北"
    }, {"name": "铜陵市", "simple": "铜陵"}, {"name": "安庆市", "simple": "安庆"}, {
        "name": "黄山市",
        "simple": "黄山"
    }, {"name": "滁州市", "simple": "滁州"}, {"name": "阜阳市", "simple": "阜阳"}, {
        "name": "宿州市",
        "simple": "宿州"
    }, {"name": "六安市", "simple": "六安"}, {"name": "亳州市", "simple": "亳州"}, {
        "name": "池州市",
        "simple": "池州"
    }, {"name": "宣城市", "simple": "宣城"}]
}, {
    "name": "辽宁省",
    "simple": "辽宁",
    "cities": [{"name": "沈阳市", "simple": "沈阳"}, {"name": "大连市", "simple": "大连"}, {
        "name": "鞍山市",
        "simple": "鞍山"
    }, {"name": "抚顺市", "simple": "抚顺"}, {"name": "本溪市", "simple": "本溪"}, {
        "name": "丹东市",
        "simple": "丹东"
    }, {"name": "锦州市", "simple": "锦州"}, {"name": "营口市", "simple": "营口"}, {
        "name": "阜新市",
        "simple": "阜新"
    }, {"name": "辽阳市", "simple": "辽阳"}, {"name": "盘锦市", "simple": "盘锦"}, {
        "name": "铁岭市",
        "simple": "铁岭"
    }, {"name": "朝阳市", "simple": "朝阳"}, {"name": "葫芦岛市", "simple": "葫芦岛"}]
}, {
    "name": "陕西省",
    "simple": "陕西",
    "cities": [{"name": "西安市", "simple": "西安"}, {"name": "铜川市", "simple": "铜川"}, {
        "name": "宝鸡市",
        "simple": "宝鸡"
    }, {"name": "咸阳市", "simple": "咸阳"}, {"name": "渭南市", "simple": "渭南"}, {
        "name": "延安市",
        "simple": "延安"
    }, {"name": "汉中市", "simple": "汉中"}, {"name": "榆林市", "simple": "榆林"}, {
        "name": "安康市",
        "simple": "安康"
    }, {"name": "商洛市", "simple": "商洛"}]
}, {
    "name": "江西省",
    "simple": "江西",
    "cities": [{"name": "南昌市", "simple": "南昌"}, {"name": "景德镇市", "simple": "景德镇"}, {
        "name": "萍乡市",
        "simple": "萍乡"
    }, {"name": "九江市", "simple": "九江"}, {"name": "新余市", "simple": "新余"}, {
        "name": "鹰潭市",
        "simple": "鹰潭"
    }, {"name": "赣州市", "simple": "赣州"}, {"name": "吉安市", "simple": "吉安"}, {
        "name": "宜春市",
        "simple": "宜春"
    }, {"name": "抚州市", "simple": "抚州"}, {"name": "上饶市", "simple": "上饶"}]
}, {
    "name": "广西壮族自治区",
    "simple": "广西",
    "cities": [{"name": "南宁市", "simple": "南宁"}, {"name": "柳州市", "simple": "柳州"}, {
        "name": "桂林市",
        "simple": "桂林"
    }, {"name": "梧州市", "simple": "梧州"}, {"name": "北海市", "simple": "北海"}, {
        "name": "防城港市",
        "simple": "防城港"
    }, {"name": "钦州市", "simple": "钦州"}, {"name": "贵港市", "simple": "贵港"}, {
        "name": "玉林市",
        "simple": "玉林"
    }, {"name": "百色市", "simple": "百色"}, {"name": "贺州市", "simple": "贺州"}, {
        "name": "河池市",
        "simple": "河池"
    }, {"name": "来宾市", "simple": "来宾"}, {"name": "崇左市", "simple": "崇左"}]
}, {
    "name": "云南省",
    "simple": "云南",
    "cities": [{"name": "昆明市", "simple": "昆明"}, {"name": "曲靖市", "simple": "曲靖"}, {
        "name": "玉溪市",
        "simple": "玉溪"
    }, {"name": "保山市", "simple": "保山"}, {"name": "昭通市", "simple": "昭通"}, {
        "name": "丽江市",
        "simple": "丽江"
    }, {"name": "普洱市", "simple": "普洱"}, {"name": "临沧市", "simple": "临沧"}, {
        "name": "楚雄彝族自治州",
        "simple": "楚雄"
    }, {"name": "红河哈尼族彝族自治州", "simple": "红河"}, {"name": "文山壮族苗族自治州", "simple": "文山"}, {
        "name": "西双版纳傣族自治州",
        "simple": "西双版纳"
    }, {"name": "大理白族自治州", "simple": "大理"}, {"name": "德宏傣族景颇族自治州", "simple": "德宏"}, {
        "name": "怒江傈僳族自治州",
        "simple": "怒江"
    }, {"name": "迪庆藏族自治州", "simple": "迪庆"}]
}, {
    "name": "内蒙古自治区",
    "simple": "内蒙古",
    "cities": [{"name": "呼和浩特市", "simple": "呼和浩特"}, {"name": "包头市", "simple": "包头"}, {
        "name": "乌海市",
        "simple": "乌海"
    }, {"name": "赤峰市", "simple": "赤峰"}, {"name": "通辽市", "simple": "通辽"}, {
        "name": "鄂尔多斯市",
        "simple": "鄂尔多斯"
    }, {"name": "呼伦贝尔市", "simple": "呼伦贝尔"}, {"name": "巴彦淖尔市", "simple": "巴彦淖尔"}, {
        "name": "乌兰察布市",
        "simple": "乌兰察布"
    }, {"name": "兴安盟", "simple": "兴安"}, {"name": "锡林郭勒盟", "simple": "锡林郭勒"}, {"name": "阿拉善盟", "simple": "阿拉善"}]
}, {
    "name": "山西省",
    "simple": "山西",
    "cities": [{"name": "太原市", "simple": "太原"}, {"name": "大同市", "simple": "大同"}, {
        "name": "阳泉市",
        "simple": "阳泉"
    }, {"name": "长治市", "simple": "长治"}, {"name": "晋城市", "simple": "晋城"}, {
        "name": "朔州市",
        "simple": "朔州"
    }, {"name": "晋中市", "simple": "晋中"}, {"name": "运城市", "simple": "运城"}, {
        "name": "忻州市",
        "simple": "忻州"
    }, {"name": "临汾市", "simple": "临汾"}, {"name": "吕梁市", "simple": "吕梁"}]
}, {
    "name": "黑龙江省",
    "simple": "黑龙江",
    "cities": [{"name": "哈尔滨市", "simple": "哈尔滨"}, {"name": "齐齐哈尔市", "simple": "齐齐哈尔"}, {
        "name": "鸡西市",
        "simple": "鸡西"
    }, {"name": "鹤岗市", "simple": "鹤岗"}, {"name": "双鸭山市", "simple": "双鸭山"}, {
        "name": "大庆市",
        "simple": "大庆"
    }, {"name": "伊春市", "simple": "伊春"}, {"name": "佳木斯市", "simple": "佳木斯"}, {
        "name": "七台河市",
        "simple": "七台河"
    }, {"name": "牡丹江市", "simple": "牡丹江"}, {"name": "黑河市", "simple": "黑河"}, {
        "name": "绥化市",
        "simple": "绥化"
    }, {"name": "大兴安岭地区", "simple": "大兴安岭"}]
}, {
    "name": "吉林省",
    "simple": "吉林",
    "cities": [{"name": "长春市", "simple": "长春"}, {"name": "吉林市", "simple": "吉林"}, {
        "name": "四平市",
        "simple": "四平"
    }, {"name": "辽源市", "simple": "辽源"}, {"name": "通化市", "simple": "通化"}, {
        "name": "白山市",
        "simple": "白山"
    }, {"name": "松原市", "simple": "松原"}, {"name": "白城市", "simple": "白城"}, {"name": "延边朝鲜族自治州", "simple": "延边"}]
}, {
    "name": "贵州省",
    "simple": "贵州",
    "cities": [{"name": "贵阳市", "simple": "贵阳"}, {"name": "六盘水市", "simple": "六盘水"}, {
        "name": "遵义市",
        "simple": "遵义"
    }, {"name": "安顺市", "simple": "安顺"}, {"name": "毕节市", "simple": "毕节"}, {
        "name": "铜仁市",
        "simple": "铜仁"
    }, {"name": "黔西南布依族苗族自治州", "simple": "黔西南"}, {"name": "黔东南苗族侗族自治州", "simple": "黔东南"}, {
        "name": "黔南布依族苗族自治州",
        "simple": "黔南"
    }]
}, {
    "name": "新疆维吾尔自治区",
    "simple": "新疆",
    "cities": [{"name": "乌鲁木齐市", "simple": "乌鲁木齐"}, {"name": "克拉玛依市", "simple": "克拉玛依"}, {
        "name": "吐鲁番市",
        "simple": "吐鲁番"
    }, {"name": "哈密市", "simple": "哈密"}, {"name": "昌吉回族自治州", "simple": "昌吉"}, {
        "name": "博尔塔拉蒙古自治州",
        "simple": "博州"
    }, {"name": "巴音郭楞蒙古自治州", "simple": "巴州"}, {"name": "阿克苏地区", "simple": "阿克苏"}, {
        "name": "克孜勒苏柯尔克孜自治州",
        "simple": "克州"
    }, {"name": "喀什地区", "simple": "喀什"}, {"name": "和田地区", "simple": "和田"}, {
        "name": "伊犁哈萨克自治州",
        "simple": "伊犁"
    }, {"name": "塔城地区", "simple": "塔城"}, {"name": "阿勒泰地区", "simple": "阿勒泰"}]
}, {
    "name": "甘肃省",
    "simple": "甘肃",
    "cities": [{"name": "兰州市", "simple": "兰州"}, {"name": "嘉峪关市", "simple": "嘉峪关"}, {
        "name": "金昌市",
        "simple": "金昌"
    }, {"name": "白银市", "simple": "白银"}, {"name": "天水市", "simple": "天水"}, {
        "name": "武威市",
        "simple": "武威"
    }, {"name": "张掖市", "simple": "张掖"}, {"name": "平凉市", "simple": "平凉"}, {
        "name": "酒泉市",
        "simple": "酒泉"
    }, {"name": "庆阳市", "simple": "庆阳"}, {"name": "定西市", "simple": "定西"}, {
        "name": "陇南市",
        "simple": "陇南"
    }, {"name": "临夏回族自治州", "simple": "临夏"}, {"name": "甘南藏族自治州", "simple": "甘南"}]
}, {
    "name": "海南省",
    "simple": "海南",
    "cities": [{"name": "海口市", "simple": "海口"}, {"name": "三亚市", "simple": "三亚"}, {
        "name": "三沙市",
        "simple": "三沙"
    }, {"name": "儋州市", "simple": "儋州"}]
}, {
    "name": "宁夏回族自治区",
    "simple": "宁夏",
    "cities": [{"name": "银川市", "simple": "银川"}, {"name": "石嘴山市", "simple": "石嘴山"}, {
        "name": "吴忠市",
        "simple": "吴忠"
    }, {"name": "固原市", "simple": "固原"}, {"name": "中卫市", "simple": "中卫"}]
}, {
    "name": "青海省",
    "simple": "青海",
    "cities": [{"name": "西宁市", "simple": "西宁"}, {"name": "海东市", "simple": "海东"}, {
        "name": "海北藏族自治州",
        "simple": "海北"
    }, {"name": "黄南藏族自治州", "simple": "黄南"}, {"name": "海南藏族自治州", "simple": "海南"}, {
        "name": "果洛藏族自治州",
        "simple": "果洛"
    }, {"name": "玉树藏族自治州", "simple": "玉树"}, {"name": "海西蒙古族藏族自治州", "simple": "海西"}]
}, {
    "name": "西藏自治区",
    "simple": "西藏",
    "cities": [{"name": "拉萨市", "simple": "拉萨"}, {"name": "日喀则市", "simple": "日喀则"}, {
        "name": "昌都市",
        "simple": "昌都"
    }, {"name": "林芝市", "simple": "林芝"}, {"name": "山南市", "simple": "山南"}, {
        "name": "那曲市",
        "simple": "那曲"
    }, {"name": "阿里地区", "simple": "阿里"}]
}, {"name": "香港特别行政区", "simple": "香港"}, {"name": "澳门特别行政区", "simple": "澳门"}, {
    "name": "台湾省",
    "simple": "台湾",
    "cities": [{"name": "台北市", "simple": "台北"}, {"name": "高雄市", "simple": "高雄"}, {
        "name": "台南市",
        "simple": "台南"
    }, {"name": "台中市", "simple": "台中"}, {"name": "南投县", "simple": "南投"}, {
        "name": "基隆市",
        "simple": "基隆"
    }, {"name": "新竹市", "simple": "新竹"}, {"name": "嘉义市", "simple": "嘉义"}, {
        "name": "新北市",
        "simple": "新北"
    }, {"name": "宜兰县", "simple": "宜兰"}, {"name": "新竹县", "simple": "新竹"}, {
        "name": "桃园市",
        "simple": "桃园"
    }, {"name": "苗栗县", "simple": "苗栗"}, {"name": "彰化县", "simple": "彰化"}, {
        "name": "嘉义县",
        "simple": "嘉义"
    }, {"name": "云林县", "simple": "云林"}, {"name": "屏东县", "simple": "屏东"}, {
        "name": "台东县",
        "simple": "台东"
    }, {"name": "花莲县", "simple": "花莲"}, {"name": "澎湖县", "simple": "澎湖"}]
},]

const CITY_CENTER =
    {
        "河池": {"code": "451200", "loc": [24.69291, 108.0854], "name": "河池市"},
        "宜春": {"code": "360900", "loc": [27.81443, 114.41612], "name": "宜春市"},
        "张家界": {"code": "430800", "loc": [29.11667, 110.47839], "name": "张家界市"},
        "辽阳": {"code": "211000", "loc": [41.26809, 123.23736], "name": "辽阳市"},
        "濮阳": {"code": "410900", "loc": [35.76189, 115.02932], "name": "濮阳市"},
        "邵阳": {"code": "430500", "loc": [27.2389, 111.4677], "name": "邵阳市"},
        "黑河": {"code": "231100", "loc": [50.24523, 127.52852], "name": "黑河市"},
        "南投": {"code": "710600", "loc": [23.919619, 120.670008], "name": "南投县"},
        "安庆": {"code": "340800", "loc": [30.54294, 117.06354], "name": "安庆市"},
        "白银": {"code": "620400", "loc": [36.5447, 104.13773], "name": "白银市"},
        "湘潭": {"code": "430300", "loc": [27.82975, 112.94411], "name": "湘潭市"},
        "安顺": {"code": "520400", "loc": [26.25367, 105.9462], "name": "安顺市"},
        "沧州": {"code": "130900", "loc": [38.30441, 116.83869], "name": "沧州市"},
        "梧州": {"code": "450400", "loc": [23.47691, 111.27917], "name": "梧州市"},
        "阿拉善": {"code": "152900", "loc": [38.85153, 105.72898], "name": "阿拉善盟"},
        "淄博": {"code": "370300", "loc": [36.8131, 118.0548], "name": "淄博市"},
        "赤峰": {"code": "150400", "loc": [42.2586, 118.88894], "name": "赤峰市"},
        "杭州": {"code": "330100", "loc": [30.27415, 120.15515], "name": "杭州市"},
        "铁岭": {"code": "211200", "loc": [42.2862, 123.84241], "name": "铁岭市"},
        "天水": {"code": "620500", "loc": [34.58085, 105.72486], "name": "天水市"},
        "福州": {"code": "350100", "loc": [26.07421, 119.29647], "name": "福州市"},
        "舟山": {"code": "330900", "loc": [29.98539, 122.20778], "name": "舟山市"},
        "龙岩": {"code": "350800", "loc": [25.07504, 117.01722], "name": "龙岩市"},
        "台东": {"code": "712500", "loc": [22.764364, 121.113207], "name": "台东县"},
        "吴忠": {"code": "640300", "loc": [37.99755, 106.19879], "name": "吴忠市"},
        "乐山": {"code": "511100", "loc": [29.55221, 103.76539], "name": "乐山市"},
        "湘西": {"code": "433100", "loc": [28.31173, 109.73893], "name": "湘西土家族苗族自治州"},
        "通化": {"code": "220500", "loc": [41.72829, 125.9399], "name": "通化市"},
        "和田": {"code": "653200", "loc": [37.11431, 79.92247], "name": "和田地区"},
        "日照": {"code": "371100", "loc": [35.41646, 119.52719], "name": "日照市"},
        "宝鸡": {"code": "610300", "loc": [34.36194, 107.23732], "name": "宝鸡市"},
        "韶关": {"code": "440200", "loc": [24.81039, 113.59723], "name": "韶关市"},
        "河源": {"code": "441600", "loc": [23.74365, 114.70065], "name": "河源市"},
        "苗栗": {"code": "711500", "loc": [24.696762, 120.884337], "name": "苗栗县"},
        "大庆": {"code": "230600", "loc": [46.58758, 125.10307], "name": "大庆市"},
        "台中": {"code": "710400", "loc": [24.143171, 120.679882], "name": "台中市"},
        "泉州": {"code": "350500", "loc": [24.87389, 118.67587], "name": "泉州市"},
        "儋州": {"code": "460400", "loc": [19.52093, 109.58069], "name": "儋州市"},
        "连云港": {"code": "320700", "loc": [34.59669, 119.22295], "name": "连云港市"},
        "邯郸": {"code": "130400", "loc": [36.62556, 114.53918], "name": "邯郸市"},
        "攀枝花": {"code": "510400", "loc": [26.58228, 101.71872], "name": "攀枝花市"},
        "潮州": {"code": "445100", "loc": [23.6567, 116.62296], "name": "潮州市"},
        "石嘴山": {"code": "640200", "loc": [38.9841, 106.38418], "name": "石嘴山市"},
        "黄山": {"code": "341000", "loc": [29.71517, 118.33866], "name": "黄山市"},
        "保山": {"code": "530500", "loc": [25.11205, 99.16181], "name": "保山市"},
        "南京": {"code": "320100", "loc": [32.05838, 118.79647], "name": "南京市"},
        "株洲": {"code": "430200", "loc": [27.82767, 113.13396], "name": "株洲市"},
        "安康": {"code": "610900", "loc": [32.68486, 109.02932], "name": "安康市"},
        "徐州": {"code": "320300", "loc": [34.2044, 117.28577], "name": "徐州市"},
        "湖州": {"code": "330500", "loc": [30.89305, 120.08805], "name": "湖州市"},
        "柳州": {"code": "450200", "loc": [24.32543, 109.41552], "name": "柳州市"},
        "绍兴": {"code": "330600", "loc": [30.03033, 120.5802], "name": "绍兴市"},
        "金昌": {"code": "620300", "loc": [38.52006, 102.18759], "name": "金昌市"},
        "重庆": {"code": "500100", "loc": [29.56471, 106.55073], "name": "重庆市"},
        "营口": {"code": "210800", "loc": [40.66683, 122.2349], "name": "营口市"},
        "玉溪": {"code": "530400", "loc": [24.3518, 102.54714], "name": "玉溪市"},
        "伊春": {"code": "230700", "loc": [47.72752, 128.84049], "name": "伊春市"},
        "吐鲁番": {"code": "650400", "loc": [42.9513, 89.18954], "name": "吐鲁番市"},
        "巴彦淖尔": {"code": "150800", "loc": [40.74317, 107.38773], "name": "巴彦淖尔市"},
        "宁德": {"code": "350900", "loc": [26.66571, 119.54819], "name": "宁德市"},
        "红河": {"code": "532500", "loc": [23.36422, 103.3756], "name": "红河哈尼族彝族自治州"},
        "葫芦岛": {"code": "211400", "loc": [40.711, 120.83699], "name": "葫芦岛市"},
        "巴州": {"code": "652800", "loc": [41.76404, 86.14517], "name": "巴音郭楞蒙古自治州"},
        "庆阳": {"code": "621000", "loc": [35.70978, 107.64292], "name": "庆阳市"},
        "辽源": {"code": "220400", "loc": [42.88805, 125.14368], "name": "辽源市"},
        "兰州": {"code": "620100", "loc": [36.06138, 103.83417], "name": "兰州市"},
        "遵义": {"code": "520300", "loc": [27.72545, 106.92723], "name": "遵义市"},
        "自贡": {"code": "510300", "loc": [29.3392, 104.77844], "name": "自贡市"},
        "乌鲁木齐": {"code": "650100", "loc": [43.82663, 87.61688], "name": "乌鲁木齐市"},
        "咸阳": {"code": "610400", "loc": [34.32932, 108.70929], "name": "咸阳市"},
        "周口": {"code": "411600", "loc": [33.62583, 114.69695], "name": "周口市"},
        "呼和浩特": {"code": "150100", "loc": [40.84149, 111.75199], "name": "呼和浩特市"},
        "拉萨": {"code": "540100", "loc": [29.64415, 91.1145], "name": "拉萨市"},
        "常德": {"code": "430700", "loc": [29.03158, 111.69854], "name": "常德市"},
        "洛阳": {"code": "410300", "loc": [34.61812, 112.45361], "name": "洛阳市"},
        "信阳": {"code": "411500", "loc": [32.14714, 114.09279], "name": "信阳市"},
        "恩施": {"code": "422800", "loc": [30.27217, 109.48817], "name": "恩施土家族苗族自治州"},
        "清远": {"code": "441800", "loc": [23.68201, 113.05615], "name": "清远市"},
        "莆田": {"code": "350300", "loc": [25.454, 119.00771], "name": "莆田市"},
        "张掖": {"code": "620700", "loc": [38.92592, 100.44981], "name": "张掖市"},
        "昌都": {"code": "540300", "loc": [31.14073, 97.17225], "name": "昌都市"},
        "佛山": {"code": "440600", "loc": [23.02185, 113.12192], "name": "佛山市"},
        "北京": {"code": "110100", "loc": [39.90469, 116.40717], "name": "北京市"},
        "宣城": {"code": "341800", "loc": [30.94078, 118.75866], "name": "宣城市"},
        "齐齐哈尔": {"code": "230200", "loc": [47.35431, 123.91796], "name": "齐齐哈尔市"},
        "怒江": {"code": "533300", "loc": [25.81763, 98.8567], "name": "怒江傈僳族自治州"},
        "嘉兴": {"code": "330400", "loc": [30.74501, 120.7555], "name": "嘉兴市"},
        "秦皇岛": {"code": "130300", "loc": [39.93545, 119.59964], "name": "秦皇岛市"},
        "汕尾": {"code": "441500", "loc": [22.78566, 115.37514], "name": "汕尾市"},
        "澎湖": {"code": "712700", "loc": [23.552351, 119.58457], "name": "澎湖县"},
        "眉山": {"code": "511400", "loc": [30.07563, 103.84851], "name": "眉山市"},
        "抚州": {"code": "361000", "loc": [27.94781, 116.35809], "name": "抚州市"},
        "海北": {"code": "632200", "loc": [36.95454, 100.90096], "name": "海北藏族自治州"},
        "普洱": {"code": "530800", "loc": [22.82521, 100.96624], "name": "普洱市"},
        "铜川": {"code": "610200", "loc": [34.89673, 108.94515], "name": "铜川市"},
        "景德镇": {"code": "360200", "loc": [29.26869, 117.17839], "name": "景德镇市"},
        "长春": {"code": "220100", "loc": [43.81602, 125.32357], "name": "长春市"},
        "泰安": {"code": "370900", "loc": [36.19994, 117.0884], "name": "泰安市"},
        "鞍山": {"code": "210300", "loc": [41.10777, 122.9946], "name": "鞍山市"},
        "澳门": {"code": "820000", "loc": [22.19875, 113.54913], "name": "澳门特别行政区"},
        "阳江": {"code": "441700", "loc": [21.85829, 111.98256], "name": "阳江市"},
        "商洛": {"code": "611000", "loc": [33.87036, 109.94041], "name": "商洛市"},
        "兴安": {"code": "152200", "loc": [46.08208, 122.03818], "name": "兴安盟"},
        "鹤岗": {"code": "230400", "loc": [47.34989, 130.29785], "name": "鹤岗市"},
        "乌海": {"code": "150300", "loc": [39.65384, 106.79546], "name": "乌海市"},
        "吉林": {"code": "220200", "loc": [43.83784, 126.54944], "name": "吉林市"},
        "上海": {"code": "310100", "loc": [31.23037, 121.4737], "name": "上海市"},
        "沈阳": {"code": "210100", "loc": [41.67718, 123.4631], "name": "沈阳市"},
        "上饶": {"code": "361100", "loc": [28.45463, 117.94357], "name": "上饶市"},
        "益阳": {"code": "430900", "loc": [28.55391, 112.35516], "name": "益阳市"},
        "楚雄": {"code": "532300", "loc": [25.04495, 101.52767], "name": "楚雄彝族自治州"},
        "曲靖": {"code": "530300", "loc": [25.49002, 103.79625], "name": "曲靖市"},
        "吉安": {"code": "360800", "loc": [27.11382, 114.99376], "name": "吉安市"},
        "永州": {"code": "431100", "loc": [26.42034, 111.61225], "name": "永州市"},
        "常州": {"code": "320400", "loc": [31.81072, 119.97365], "name": "常州市"},
        "广元": {"code": "510800", "loc": [32.43549, 105.84357], "name": "广元市"},
        "巴中": {"code": "511900", "loc": [31.86715, 106.74733], "name": "巴中市"},
        "德宏": {"code": "533100", "loc": [24.43232, 98.58486], "name": "德宏傣族景颇族自治州"},
        "克拉玛依": {"code": "650200", "loc": [45.57999, 84.88927], "name": "克拉玛依市"},
        "日喀则": {"code": "540200", "loc": [29.26705, 88.88116], "name": "日喀则市"},
        "朝阳": {"code": "211300", "loc": [41.57347, 120.4508], "name": "朝阳市"},
        "伊犁": {"code": "654000", "loc": [43.91689, 81.32416], "name": "伊犁哈萨克自治州"},
        "新乡": {"code": "410700", "loc": [35.30323, 113.92675], "name": "新乡市"},
        "那曲": {"code": "540600", "loc": [31.47614, 92.05136], "name": "那曲市"},
        "临汾": {"code": "141000", "loc": [36.08822, 111.51962], "name": "临汾市"},
        "蚌埠": {"code": "340300", "loc": [32.91548, 117.38932], "name": "蚌埠市"},
        "昆明": {"code": "530100", "loc": [24.87966, 102.83322], "name": "昆明市"},
        "南充": {"code": "511300", "loc": [30.83731, 106.11073], "name": "南充市"},
        "包头": {"code": "150200", "loc": [40.65781, 109.84021], "name": "包头市"},
        "渭南": {"code": "610500", "loc": [34.49997, 109.51015], "name": "渭南市"},
        "临沂": {"code": "371300", "loc": [35.10465, 118.35646], "name": "临沂市"},
        "赣州": {"code": "360700", "loc": [25.83109, 114.93476], "name": "赣州市"},
        "聊城": {"code": "371500", "loc": [36.45702, 115.98549], "name": "聊城市"},
        "海南": {"code": "632500", "loc": [36.28663, 100.62037], "name": "海南藏族自治州"},
        "鹤壁": {"code": "410600", "loc": [35.747, 114.29745], "name": "鹤壁市"},
        "肇庆": {"code": "441200", "loc": [23.0469, 112.46528], "name": "肇庆市"},
        "牡丹江": {"code": "231000", "loc": [44.55269, 129.63244], "name": "牡丹江市"},
        "黔东南": {"code": "522600", "loc": [26.58364, 107.98416], "name": "黔东南苗族侗族自治州"},
        "中卫": {"code": "640500", "loc": [37.50026, 105.19676], "name": "中卫市"},
        "温州": {"code": "330300", "loc": [27.99492, 120.69939], "name": "温州市"},
        "榆林": {"code": "610800", "loc": [38.2852, 109.73458], "name": "榆林市"},
        "嘉峪关": {"code": "620200", "loc": [39.77201, 98.29011], "name": "嘉峪关市"},
        "绥化": {"code": "231200", "loc": [46.65246, 126.96932], "name": "绥化市"},
        "成都": {"code": "510100", "loc": [30.5702, 104.06476], "name": "成都市"},
        "广安": {"code": "511600", "loc": [30.45596, 106.63322], "name": "广安市"},
        "阿勒泰": {"code": "654300", "loc": [47.84564, 88.14023], "name": "阿勒泰地区"},
        "泰州": {"code": "321200", "loc": [32.45546, 119.92554], "name": "泰州市"},
        "淮北": {"code": "340600", "loc": [33.95479, 116.79834], "name": "淮北市"},
        "阳泉": {"code": "140300", "loc": [37.85668, 113.58047], "name": "阳泉市"},
        "海西": {"code": "632800", "loc": [37.3771, 97.37122], "name": "海西蒙古族藏族自治州"},
        "长沙": {"code": "430100", "loc": [28.22778, 112.93886], "name": "长沙市"},
        "阿坝": {"code": "513200", "loc": [31.8994, 102.22477], "name": "阿坝藏族羌族自治州"},
        "鹰潭": {"code": "360600", "loc": [28.26019, 117.06919], "name": "鹰潭市"},
        "晋城": {"code": "140500", "loc": [35.49039, 112.85113], "name": "晋城市"},
        "盐城": {"code": "320900", "loc": [33.34951, 120.16164], "name": "盐城市"},
        "通辽": {"code": "150500", "loc": [43.65247, 122.24469], "name": "通辽市"},
        "本溪": {"code": "210500", "loc": [41.29413, 123.76686], "name": "本溪市"},
        "惠州": {"code": "441300", "loc": [23.11075, 114.41679], "name": "惠州市"},
        "四平": {"code": "220300", "loc": [43.16646, 124.35036], "name": "四平市"},
        "果洛": {"code": "632600", "loc": [34.47141, 100.24475], "name": "果洛藏族自治州"},
        "云浮": {"code": "445300", "loc": [22.91525, 112.04453], "name": "云浮市"},
        "三门峡": {"code": "411200", "loc": [34.77261, 111.2003], "name": "三门峡市"},
        "来宾": {"code": "451300", "loc": [23.7521, 109.22238], "name": "来宾市"},
        "焦作": {"code": "410800", "loc": [35.21563, 113.24201], "name": "焦作市"},
        "临沧": {"code": "530900", "loc": [23.88426, 100.08884], "name": "临沧市"},
        "烟台": {"code": "370600", "loc": [37.46353, 121.44801], "name": "烟台市"},
        "扬州": {"code": "321000", "loc": [32.39358, 119.41269], "name": "扬州市"},
        "白城": {"code": "220800", "loc": [45.6196, 122.83871], "name": "白城市"},
        "苏州": {"code": "320500", "loc": [31.29834, 120.58319], "name": "苏州市"},
        "高雄": {"code": "710200", "loc": [22.630576, 120.306839], "name": "高雄市"},
        "南宁": {"code": "450100", "loc": [22.81673, 108.3669], "name": "南宁市"},
        "黄南": {"code": "632300", "loc": [35.51991, 102.01507], "name": "黄南藏族自治州"},
        "十堰": {"code": "420300", "loc": [32.62918, 110.79801], "name": "十堰市"},
        "阜新": {"code": "210900", "loc": [42.02166, 121.67011], "name": "阜新市"},
        "漳州": {"code": "350600", "loc": [24.51347, 117.64725], "name": "漳州市"},
        "桃园": {"code": "711400", "loc": [24.982757, 121.213608], "name": "桃园市"},
        "吕梁": {"code": "141100", "loc": [37.51934, 111.14165], "name": "吕梁市"},
        "厦门": {"code": "350200", "loc": [24.47951, 118.08948], "name": "厦门市"},
        "汉中": {"code": "610700", "loc": [33.06761, 107.02377], "name": "汉中市"},
        "丹东": {"code": "210600", "loc": [39.9998, 124.35601], "name": "丹东市"},
        "开封": {"code": "410200", "loc": [34.79726, 114.30731], "name": "开封市"},
        "铜陵": {"code": "340700", "loc": [30.94486, 117.81232], "name": "铜陵市"},
        "东莞": {"code": "441900", "loc": [23.02067, 113.75179], "name": "东莞市"},
        "石家庄": {"code": "130100", "loc": [38.04276, 114.5143], "name": "石家庄市"},
        "德州": {"code": "371400", "loc": [37.4355, 116.35927], "name": "德州市"},
        "佳木斯": {"code": "230800", "loc": [46.79977, 130.31882], "name": "佳木斯市"},
        "山南": {"code": "540500", "loc": [29.23705, 91.77313], "name": "山南市"},
        "鄂州": {"code": "420700", "loc": [30.39085, 114.89495], "name": "鄂州市"},
        "长治": {"code": "140400", "loc": [36.19581, 113.11649], "name": "长治市"},
        "黔南": {"code": "522700", "loc": [26.25427, 107.52226], "name": "黔南布依族苗族自治州"},
        "承德": {"code": "130800", "loc": [40.9515, 117.9634], "name": "承德市"},
        "天津": {"code": "120100", "loc": [39.0851, 117.19937], "name": "天津市"},
        "娄底": {"code": "431300", "loc": [27.69728, 111.99458], "name": "娄底市"},
        "平顶山": {"code": "410400", "loc": [33.76609, 113.19241], "name": "平顶山市"},
        "莱芜": {"code": "371200", "loc": [36.21359, 117.67667], "name": "莱芜市"},
        "怀化": {"code": "431200", "loc": [27.56974, 110.0016], "name": "怀化市"},
        "菏泽": {"code": "371700", "loc": [35.23363, 115.48115], "name": "菏泽市"},
        "玉林": {"code": "450900", "loc": [22.65451, 110.18098], "name": "玉林市"},
        "淮南": {"code": "340400", "loc": [32.62549, 116.9998], "name": "淮南市"},
        "七台河": {"code": "230900", "loc": [45.77065, 131.00306], "name": "七台河市"},
        "芜湖": {"code": "340200", "loc": [31.35246, 118.43313], "name": "芜湖市"},
        "抚顺": {"code": "210400", "loc": [41.87971, 123.95722], "name": "抚顺市"},
        "三明": {"code": "350400", "loc": [26.26385, 117.63922], "name": "三明市"},
        "台北": {"code": "710100", "loc": [25.030724, 121.520076], "name": "台北市"},
        "定西": {"code": "621100", "loc": [35.58113, 104.62524], "name": "定西市"},
        "云林": {"code": "712100", "loc": [23.664943, 120.480738], "name": "云林县"},
        "滁州": {"code": "341100", "loc": [32.30181, 118.31683], "name": "滁州市"},
        "驻马店": {"code": "411700", "loc": [33.01142, 114.02299], "name": "驻马店市"},
        "甘南": {"code": "623000", "loc": [34.98327, 102.91102], "name": "甘南藏族自治州"},
        "花莲": {"code": "712600", "loc": [24.000674, 121.59729], "name": "花莲县"},
        "广州": {"code": "440100", "loc": [23.12908, 113.26436], "name": "广州市"},
        "郑州": {"code": "410100", "loc": [34.74725, 113.62493], "name": "郑州市"},
        "随州": {"code": "421300", "loc": [31.69013, 113.38262], "name": "随州市"},
        "毕节": {"code": "520500", "loc": [27.29847, 105.30504], "name": "毕节市"},
        "盘锦": {"code": "211100", "loc": [41.11996, 122.07078], "name": "盘锦市"},
        "海口": {"code": "460100", "loc": [20.04422, 110.19989], "name": "海口市"},
        "许昌": {"code": "411000", "loc": [34.0357, 113.85233], "name": "许昌市"},
        "新竹": {"code": "711300", "loc": [24.839233, 121.002012], "name": "新竹县"},
        "朔州": {"code": "140600", "loc": [39.33155, 112.43286], "name": "朔州市"},
        "荆州": {"code": "421000", "loc": [30.33479, 112.24069], "name": "荆州市"},
        "忻州": {"code": "140900", "loc": [38.4167, 112.73418], "name": "忻州市"},
        "喀什": {"code": "653100", "loc": [39.47042, 75.98976], "name": "喀什地区"},
        "北海": {"code": "450500", "loc": [21.48112, 109.12008], "name": "北海市"},
        "甘孜": {"code": "513300", "loc": [30.04932, 101.96254], "name": "甘孜藏族自治州"},
        "无锡": {"code": "320200", "loc": [31.49099, 120.31237], "name": "无锡市"},
        "枣庄": {"code": "370400", "loc": [34.81071, 117.32196], "name": "枣庄市"},
        "晋中": {"code": "140700", "loc": [37.68702, 112.75278], "name": "晋中市"},
        "德阳": {"code": "510600", "loc": [31.12679, 104.3979], "name": "德阳市"},
        "临夏": {"code": "622900", "loc": [35.60122, 103.21091], "name": "临夏回族自治州"},
        "哈尔滨": {"code": "230100", "loc": [45.80216, 126.5358], "name": "哈尔滨市"},
        "武威": {"code": "620600", "loc": [37.9282, 102.63797], "name": "武威市"},
        "淮安": {"code": "320800", "loc": [33.61016, 119.01595], "name": "淮安市"},
        "保定": {"code": "130600", "loc": [38.87396, 115.46459], "name": "保定市"},
        "黄冈": {"code": "421100", "loc": [30.45347, 114.87238], "name": "黄冈市"},
        "延安": {"code": "610600", "loc": [36.58529, 109.48978], "name": "延安市"},
        "茂名": {"code": "440900", "loc": [21.66329, 110.92523], "name": "茂名市"},
        "阿克苏": {"code": "652900", "loc": [41.16842, 80.26008], "name": "阿克苏地区"},
        "宜兰": {"code": "711200", "loc": [24.759707, 121.754442], "name": "宜兰县"},
        "江门": {"code": "440700", "loc": [22.57865, 113.08161], "name": "江门市"},
        "湛江": {"code": "440800", "loc": [21.27134, 110.35894], "name": "湛江市"},
        "漯河": {"code": "411100", "loc": [33.58149, 114.01681], "name": "漯河市"},
        "孝感": {"code": "420900", "loc": [30.92483, 113.91645], "name": "孝感市"},
        "锦州": {"code": "210700", "loc": [41.09515, 121.12703], "name": "锦州市"},
        "嘉义": {"code": "711900", "loc": [23.434473, 120.624255], "name": "嘉义县"},
        "唐山": {"code": "130200", "loc": [39.63048, 118.18058], "name": "唐山市"},
        "新北": {"code": "711100", "loc": [25.1853, 121.663675], "name": "新北市"},
        "鸡西": {"code": "230300", "loc": [45.29524, 130.96954], "name": "鸡西市"},
        "台南": {"code": "710300", "loc": [22.998601, 120.187817], "name": "台南市"},
        "遂宁": {"code": "510900", "loc": [30.53286, 105.59273], "name": "遂宁市"},
        "深圳": {"code": "440300", "loc": [22.54286, 114.05956], "name": "深圳市"},
        "内江": {"code": "511000", "loc": [29.58015, 105.05844], "name": "内江市"},
        "昌吉": {"code": "652300", "loc": [44.01117, 87.30822], "name": "昌吉回族自治州"},
        "汕头": {"code": "440500", "loc": [23.3535, 116.68221], "name": "汕头市"},
        "荆门": {"code": "420800", "loc": [31.03546, 112.19945], "name": "荆门市"},
        "池州": {"code": "341700", "loc": [30.66469, 117.49142], "name": "池州市"},
        "雅安": {"code": "511800", "loc": [30.01053, 103.0424], "name": "雅安市"},
        "铜仁": {"code": "520600", "loc": [27.69066, 109.18099], "name": "铜仁市"},
        "郴州": {"code": "431000", "loc": [25.77063, 113.01485], "name": "郴州市"},
        "乌兰察布": {"code": "150900", "loc": [40.99391, 113.13376], "name": "乌兰察布市"},
        "张家口": {"code": "130700", "loc": [40.82444, 114.88755], "name": "张家口市"},
        "襄阳": {"code": "420600", "loc": [32.009, 112.12255], "name": "襄阳市"},
        "资阳": {"code": "512000", "loc": [30.12859, 104.62798], "name": "资阳市"},
        "阿里": {"code": "542500", "loc": [30.40051, 81.1454], "name": "阿里地区"},
        "东营": {"code": "370500", "loc": [37.43365, 118.67466], "name": "东营市"},
        "昭通": {"code": "530600", "loc": [27.33817, 103.7168], "name": "昭通市"},
        "亳州": {"code": "341600", "loc": [33.84461, 115.77931], "name": "亳州市"},
        "阜阳": {"code": "341200", "loc": [32.88963, 115.81495], "name": "阜阳市"},
        "海东": {"code": "630200", "loc": [36.48209, 102.40173], "name": "海东市"},
        "宁波": {"code": "330200", "loc": [29.87386, 121.55027], "name": "宁波市"},
        "贵港": {"code": "450800", "loc": [23.11306, 109.59764], "name": "贵港市"},
        "金华": {"code": "330700", "loc": [29.07812, 119.64759], "name": "金华市"},
        "贵阳": {"code": "520100", "loc": [26.64702, 106.63024], "name": "贵阳市"},
        "延边": {"code": "222400", "loc": [42.89119, 129.5091], "name": "延边朝鲜族自治州"},
        "潍坊": {"code": "370700", "loc": [36.70686, 119.16176], "name": "潍坊市"},
        "西双版纳": {"code": "532800", "loc": [22.00749, 100.79739], "name": "西双版纳傣族自治州"},
        "合肥": {"code": "340100", "loc": [31.82057, 117.22901], "name": "合肥市"},
        "商丘": {"code": "411400", "loc": [34.41427, 115.65635], "name": "商丘市"},
        "桂林": {"code": "450300", "loc": [25.27361, 110.29002], "name": "桂林市"},
        "珠海": {"code": "440400", "loc": [22.27073, 113.57668], "name": "珠海市"},
        "白山": {"code": "220600", "loc": [41.9408, 126.42443], "name": "白山市"},
        "青岛": {"code": "370200", "loc": [36.06623, 120.38299], "name": "青岛市"},
        "大连": {"code": "210200", "loc": [38.91369, 121.61476], "name": "大连市"},
        "威海": {"code": "371000", "loc": [37.51348, 122.12171], "name": "威海市"},
        "丽水": {"code": "331100", "loc": [28.4672, 119.92293], "name": "丽水市"},
        "邢台": {"code": "130500", "loc": [37.07055, 114.50443], "name": "邢台市"},
        "南昌": {"code": "360100", "loc": [28.68202, 115.85794], "name": "南昌市"},
        "酒泉": {"code": "620900", "loc": [39.73255, 98.49394], "name": "酒泉市"},
        "香港": {"code": "810000", "loc": [22.27534, 114.16546], "name": "香港特别行政区"},
        "新余": {"code": "360500", "loc": [27.81776, 114.91713], "name": "新余市"},
        "马鞍山": {"code": "340500", "loc": [31.67067, 118.50611], "name": "马鞍山市"},
        "玉树": {"code": "632700", "loc": [33.00528, 97.0065], "name": "玉树藏族自治州"},
        "屏东": {"code": "712400", "loc": [22.666716, 120.492005], "name": "屏东县"},
        "南通": {"code": "320600", "loc": [31.97958, 120.89371], "name": "南通市"},
        "宜宾": {"code": "511500", "loc": [28.7513, 104.6417], "name": "宜宾市"},
        "九江": {"code": "360400", "loc": [29.70548, 116.00146], "name": "九江市"},
        "衢州": {"code": "330800", "loc": [28.93592, 118.87419], "name": "衢州市"},
        "彰化": {"code": "711700", "loc": [24.068523, 120.557479], "name": "彰化县"},
        "武汉": {"code": "420100", "loc": [30.59276, 114.30525], "name": "武汉市"},
        "大理": {"code": "532900", "loc": [25.60648, 100.26764], "name": "大理白族自治州"},
        "崇左": {"code": "451400", "loc": [22.37895, 107.36485], "name": "崇左市"},
        "银川": {"code": "640100", "loc": [38.48644, 106.23248], "name": "银川市"},
        "六安": {"code": "341500", "loc": [31.73488, 116.52324], "name": "六安市"},
        "南阳": {"code": "411300", "loc": [32.99073, 112.52851], "name": "南阳市"},
        "三亚": {"code": "460200", "loc": [18.25248, 109.51209], "name": "三亚市"},
        "三沙": {"code": "460300", "loc": [16.83272, 112.33356], "name": "三沙市"},
        "百色": {"code": "451000", "loc": [23.90216, 106.61838], "name": "百色市"},
        "黄石": {"code": "420200", "loc": [30.19953, 115.0389], "name": "黄石市"},
        "平凉": {"code": "620800", "loc": [35.54303, 106.6653], "name": "平凉市"},
        "太原": {"code": "140100", "loc": [37.87059, 112.55067], "name": "太原市"},
        "安阳": {"code": "410500", "loc": [36.09771, 114.3931], "name": "安阳市"},
        "凉山": {"code": "513400", "loc": [27.88164, 102.26746], "name": "凉山彝族自治州"},
        "咸宁": {"code": "421200", "loc": [29.84126, 114.32245], "name": "咸宁市"},
        "济南": {"code": "370100", "loc": [36.65184, 117.12009], "name": "济南市"},
        "文山": {"code": "532600", "loc": [23.39849, 104.21504], "name": "文山壮族苗族自治州"},
        "基隆": {"code": "710700", "loc": [25.122105, 121.741526], "name": "基隆市"},
        "六盘水": {"code": "520200", "loc": [26.59336, 104.83023], "name": "六盘水市"},
        "廊坊": {"code": "131000", "loc": [39.53775, 116.68376], "name": "廊坊市"},
        "丽江": {"code": "530700", "loc": [26.85648, 100.2271], "name": "丽江市"},
        "迪庆": {"code": "533400", "loc": [27.81908, 99.70305], "name": "迪庆藏族自治州"},
        "博州": {"code": "652700", "loc": [44.90597, 82.06665], "name": "博尔塔拉蒙古自治州"},
        "大同": {"code": "140200", "loc": [40.07637, 113.30001], "name": "大同市"},
        "绵阳": {"code": "510700", "loc": [31.46751, 104.6796], "name": "绵阳市"},
        "陇南": {"code": "621200", "loc": [33.401, 104.92166], "name": "陇南市"},
        "衡阳": {"code": "430400", "loc": [26.89324, 112.57195], "name": "衡阳市"},
        "衡水": {"code": "131100", "loc": [37.73886, 115.67054], "name": "衡水市"},
        "呼伦贝尔": {"code": "150700", "loc": [49.21163, 119.76584], "name": "呼伦贝尔市"},
        "萍乡": {"code": "360300", "loc": [27.62289, 113.85427], "name": "萍乡市"},
        "台州": {"code": "331000", "loc": [28.65611, 121.42056], "name": "台州市"},
        "鄂尔多斯": {"code": "150600", "loc": [39.60845, 109.78087], "name": "鄂尔多斯市"},
        "黔西南": {"code": "522300", "loc": [25.08988, 104.90437], "name": "黔西南布依族苗族自治州"},
        "宿迁": {"code": "321300", "loc": [33.96193, 118.27549], "name": "宿迁市"},
        "揭阳": {"code": "445200", "loc": [23.54972, 116.37271], "name": "揭阳市"},
        "钦州": {"code": "450700", "loc": [21.9797, 108.65431], "name": "钦州市"},
        "镇江": {"code": "321100", "loc": [32.18959, 119.425], "name": "镇江市"},
        "岳阳": {"code": "430600", "loc": [29.35728, 113.12919], "name": "岳阳市"},
        "林芝": {"code": "540400", "loc": [29.64895, 94.36155], "name": "林芝市"},
        "泸州": {"code": "510500", "loc": [28.8717, 105.44257], "name": "泸州市"},
        "中山": {"code": "442000", "loc": [22.51595, 113.3926], "name": "中山市"},
        "松原": {"code": "220700", "loc": [45.1411, 124.82515], "name": "松原市"},
        "防城港": {"code": "450600", "loc": [21.68713, 108.35472], "name": "防城港市"},
        "固原": {"code": "640400", "loc": [36.0158, 106.24259], "name": "固原市"},
        "运城": {"code": "140800", "loc": [35.02628, 111.00699], "name": "运城市"},
        "塔城": {"code": "654200", "loc": [46.74532, 82.98046], "name": "塔城地区"},
        "达州": {"code": "511700", "loc": [31.20864, 107.46791], "name": "达州市"},
        "大兴安岭": {"code": "232700", "loc": [51.92398, 124.59216], "name": "大兴安岭地区"},
        "西宁": {"code": "630100", "loc": [36.61729, 101.77782], "name": "西宁市"},
        "宿州": {"code": "341300", "loc": [33.64614, 116.96391], "name": "宿州市"},
        "哈密": {"code": "650500", "loc": [42.81855, 93.51538], "name": "哈密市"},
        "梅州": {"code": "441400", "loc": [24.28844, 116.12264], "name": "梅州市"},
        "贺州": {"code": "451100", "loc": [24.40346, 111.56655], "name": "贺州市"},
        "南平": {"code": "350700", "loc": [27.33175, 118.12043], "name": "南平市"},
        "克州": {"code": "653000", "loc": [39.7153, 76.16661], "name": "克孜勒苏柯尔克孜自治州"},
        "锡林郭勒": {"code": "152500", "loc": [43.9332, 116.04775], "name": "锡林郭勒盟"},
        "西安": {"code": "610100", "loc": [34.34127, 108.93984], "name": "西安市"},
        "宜昌": {"code": "420500", "loc": [30.69186, 111.28642], "name": "宜昌市"},
        "滨州": {"code": "371600", "loc": [37.38211, 117.97279], "name": "滨州市"},
        "双鸭山": {"code": "230500", "loc": [46.64658, 131.1591], "name": "双鸭山市"},
        "济宁": {"code": "370800", "loc": [35.41459, 116.58724], "name": "济宁市"},
        "全国": {"code": "000000", "loc": [39.90469, 116.40717], "name": "全国"}
    }


export const getCityInfo = (simple) => {
    return CITY_CENTER[simple]
}

export const getCityInfoByName = (cityName) => {
    let simple = ''
    for (const province of CITY_LIST) {
        if (province.name === cityName) {
            simple = province.simple
            break
        }
        if (province.cities) {
            for (const city of province.cities) {
                if (city.name === cityName) {
                    simple = city.simple
                    break
                }
            }
        }
    }

    return CITY_CENTER[simple]
}
